In [208]:
import pandas as pd

In [209]:
df = pd.read_csv("tabela2_1.csv", sep=";")

In [210]:
df.head()

,N,estado_civil,grau_instrucao,n_filhos,salario,idade_anos,idade_meses,reg_procedencia
0,1,solteiro,ensino fundamental,NaN,"4,00",26,3,interior
1,2,casado,ensino fundamental,1.0,"4,56",32,10,capital
2,3,casado,ensino fundamental,2.0,"5,25",36,5,capital
3,4,solteiro,ensino médio,NaN,"5,73",20,10,outra
4,5,solteiro,ensino fundamental,NaN,"6,26",40,7,outra

In [211]:
df.describe()

               N   n_filhos  idade_anos  idade_meses
count  36.000000  20.000000   36.000000    36.000000
mean   18.500000   1.650000   34.583333     5.611111
std    10.535654   1.268028    6.737422     3.288749
min     1.000000   0.000000   20.000000     0.000000
25%     9.750000   1.000000   30.000000     3.750000
50%    18.500000   2.000000   34.500000     6.000000
75%    27.250000   2.000000   40.000000     8.000000
max    36.000000   5.000000   48.000000    11.000000

In [212]:
print(df["n_filhos"].count().sum())
print(df["n_filhos"].isna().sum())

20
16

In [213]:
print(df.count().sum())
print(df.isna().sum())

272
N                   0
estado_civil        0
grau_instrucao      0
n_filhos           16
salario             0
idade_anos          0
idade_meses         0
reg_procedencia     0
dtype: int64

In [214]:
print("SALÁRIOS")
print("Mínima:", df["salario"].max())
print("Máxima:", df["salario"].min())

SALÁRIOS
Mínima: 9,80
Máxima: 10,53

In [215]:
df["salario"].describe()

count        36
unique       36
top       18,75
freq          1
Name: salario, dtype: object

In [216]:
salarios = df['salario'].str.replace(",", ".")

In [217]:
type(salarios)

pandas.core.series.Series

In [218]:
salarios = pd.to_numeric(salarios)

In [219]:
salarios.mean()

11.12222222222222

In [220]:
df['salario'] = df['salario'].infer_objects()

In [221]:
df['salario'].to_numeric()

AttributeError: 'Series' object has no attribute 'to_numeric'

In [ ]:
#df['salario'] = pd.to_numeric(df['salario'], errors='ignore')

In [223]:
df['salario'] = df['salario'].str.replace(",", ".")

In [224]:
df["salario"]

0      4.00
1      4.56
2      5.25
3      5.73
4      6.26
5      6.66
6      6.86
7      7.39
8      7.59
9      7.44
10     8.12
11     8.46
12     8.74
13     8.95
14     9.13
15     9.35
16     9.77
17     9.80
18    10.53
19    10.76
20    11.06
21    11.59
22    12.00
23    12.79
24    13.23
25    13.60
26    13.85
27    14.69
28    14.71
29    15.99
30    16.22
31    16.61
32    17.26
33    18.75
34    19.40
35    23.30
Name: salario, dtype: object

In [227]:
df['salario'] = pd.to_numeric(df['salario'])
df['salario'].mean()

11.12222222222222

In [228]:
df.describe()

               N   n_filhos    salario  idade_anos  idade_meses
count  36.000000  20.000000  36.000000   36.000000    36.000000
mean   18.500000   1.650000  11.122222   34.583333     5.611111
std    10.535654   1.268028   4.587458    6.737422     3.288749
min     1.000000   0.000000   4.000000   20.000000     0.000000
25%     9.750000   1.000000   7.552500   30.000000     3.750000
50%    18.500000   2.000000  10.165000   34.500000     6.000000
75%    27.250000   2.000000  14.060000   40.000000     8.000000
max    36.000000   5.000000  23.300000   48.000000    11.000000

## Coluna "salário" como string e não number

Passei um tempão investigando porque não era possível fazer a média do salário.

Após muitas idas e vindas na documentação e em soluções, acabei usando um pouco desta [referência](https://stackoverflow.com/questions/15891038/change-column-type-in-pandas#:~:text=The%20best%20way%20to%20convert%20one%20or%20more%20columns%20of,floating%20point%20numbers%20as%20appropriate.), mas não de maneira sequencial (pincelei algumas coisas e fui na tentativa e erro).

O processo que deu certo foi mais ou menos assim:

1. Substituir "," por "." em ```df['salario']``` (tentei fazer antes sem isso e dava tudo Nan para os valores)
2. Converter para to_numeric
3. Fazer a média.

No ```describe```também deu certo.

In [229]:
# Vou brincar lá no Colab